#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

int main()
{
	int n,t;
	int a, b, c;
	int cnt = 0;
	scanf("%d", &n);
	if (n < 100)
	{
		printf("%d", n);
	}
	else//99개 추가. 100~999까지의 가능성. 
	{
		for (int i = 100; i <= n; i++)
		{
			t = i;
			a = t / 100;//백의자리
			t = t%100;
			b = t / 10;//십의자리
			t = t % 10;
			c = t;//일의자리
			if (i % 111 == 0)
			{
				cnt += 1;
			}
			if (a + 1 == b && b + 1 == c || c + 1 == b && b + 1 == a)
			{
				cnt += 1;
			}
			if (a + 2 == b && b + 2 == c || c + 2 == b && b + 2 == a)
			{
				cnt += 1;
			}
			if (a + 3 == b && b + 3 == c || c + 3 == b && b + 3 == a)
			{
				cnt += 1;
			}
			if (a + 4 == b && b + 4 == c || c + 4 == b && b + 4 == a)
			{
				cnt += 1;
			}
		}
		printf("%d", 99 + cnt);
	}
	/*111,222,333...999까지 같은수
	* 123,234,345,456,567,678,789등 1씩차이. 반대로 321,432,543,654,765,876,987그리고 210
	* 135,246,357,468,579등 2차이. 반대로 975,864,753,642,531그리고 420
	* 147,258,369등 3차이. 반대로 741,852,963 그리고 630
	* 159등 4차이. 반대로 951 그리고 840
	*/	
	return 0;
}